sdaiValidateRequiredAttrs(Sdai_instS*,Sdai_Id_aggr*)
\details
Validates whether mandatory explicit attributes of the specified instance are set.
Retrieves the non-persistent list of unset attributes, if found.
\param instance [in]  An identifier of the application instance to be validated.
\param list     [out] An identifier of a pre-existing NPL that stores the list of identifiers of invalid explicit attributes.
\returns sdaiTRUE if unset attributes are not found; otherwise, the function returns sdaiFALSE.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiMX_NDEF - SDAI-model access not defined.
* sdaiEI_NEXS - Instance does not exist.
* sdaiAI_NEXS - Aggregate instance does not exist.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.
\code
SdaiRep repo = sdaiOpenRepositoryBN(session, "test_repository");
SdaiModel model = sdaiCreateModelBN(repo, "default", "odatest");
sdaiPromoteModel(model);
...
SdaiAppInstance person = sdaiCreateInstanceBN(model, "odaperson");
npl = sdaiCreateNPL();
requiredOk = sdaiValidateRequiredAttrs(person, npl);